cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "anyenv"
brew "coreutils"
brew "direnv"
brew "fish"
brew "fzf"
brew "gdb"
brew "gh"
brew "git"
brew "mysql-client"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"

cask "1password"
cask "alfred"
cask "bettertouchtool"
cask "clipy"
cask "deepl"
cask "docker"
cask "google-chrome"
cask "google-japanese-ime"
cask "hyperswitch"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "skitch"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "tableplus"
cask "visual-studio-code"
