cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "knative/client"

brew "anyenv"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "autossh"
brew "docutils"
brew "awscli"
brew "coreutils"
brew "bats-core"
brew "cairo"
brew "circleci"
brew "curl"
brew "direnv"
brew "docker", link: false
brew "fish"
brew "fzf"
brew "gawk"
brew "gcc"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "gnu-getopt", link: true
brew "unbound"
brew "gnutls"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "pinentry"
brew "gnupg"
brew "netpbm"
brew "gts"
brew "harfbuzz"
brew "librsvg"
brew "graphviz"
brew "jq"
brew "jsonnet"
brew "jsonnet-bundler"
brew "k9s"
brew "openjdk"
brew "ktlint"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "libfido2"
brew "libpq"
brew "mysql", link: false
brew "mysql-client"
brew "mysql-client@8.4", link: true
brew "perl"
brew "virtualenv"
brew "pre-commit"
brew "proxychains-ng"
brew "redis"
brew "shellcheck"
brew "skaffold"
brew "starship"
brew "stern"
brew "tanka"
brew "terraform"
brew "terragrunt"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "trino"
brew "util-linux"
brew "vim"
brew "wget"
brew "knative/client/kn"

cask "1password", args: { appdir: "/Applications" }
cask "alfred", args: { appdir: "/Applications" }
cask "bettertouchtool", args: { appdir: "/Applications" }
cask "charles"
cask "clipy", args: { appdir: "/Applications" }
cask "cyberduck"
cask "deepl", args: { appdir: "/Applications" }
cask "discord"
cask "docker", args: { appdir: "/Applications" }
cask "font-hack-nerd-font"
cask "google-japanese-ime", args: { appdir: "/Applications" }
cask "graphiql"
cask "hyperswitch", args: { appdir: "/Applications" }
cask "insomnia"
cask "iterm2", args: { appdir: "/Applications" }
cask "jetbrains-toolbox", args: { appdir: "/Applications" }
cask "karabiner-elements", args: { appdir: "/Applications" }
cask "mysqlworkbench"
cask "session-manager-plugin"
cask "skitch", args: { appdir: "/Applications" }
cask "sourcetree", args: { appdir: "/Applications" }
cask "spotify", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }