0rax/fish-bd
edc/bass
evanlucas/fish-kubectl-completions
fisherman/getopts
fisherman/z
ikuo-suyama/theme-clearance
jethrokuan/fzf
oh-my-fish/plugin-expand
oh-my-fish/plugin-balias
